{
  "Version": "1.3",
  "ID": "f1fdtvv57oewvd7eeoyplazum3amcfrpa4dd5ibpi",
  "Issue Number": "4",
  "Client": {
    "Name": "HMPDACC",
    "Region": "United States",
    "Industry": "Life Science / Healthcare",
    "Website": "www.hmpdacc.org",
    "Social Media": "www.hmpdacc.org",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "D&D Tech is a technology company based in Hong Kong. We specialize in data storage, data encryption. Is a participant and builder of Filecoin and IPFS.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "The Human Microbiome Project (HMP) explored microbial communities of the human body in both healthy and disease states. Two phases of the HMP (HMP and iHMP) together generated >48TB of data (public and controlled access) from multiple, varied omics studies of both the microbiome and associated hosts. The Human Microbiome Project Data Coordination Center (HMPDACC) was established to provide a portal to access data and resources produced by the HMP. The HMPDACC provides a unified data repository, multi-faceted search functionality, analysis pipelines and standardized protocols to facilitate community use of HMP data. Recent efforts have been put toward making HMP data more findable, accessible, interoperable and reusable. HMPDACC resources are freely available at www.hmpdacc.org.",
    "Where was the data currently stored in this dataset sourced from": "AWS Cloud",
    "How do you plan to prepare the dataset": "We used the Go language to develop a set of tools that automatically download, cut, package data, and place orders. The tool will download the data set file from AWS, package the data set into a car file of the corresponding size by setting parameters such as sector size, and then distribute the car file to each SP through bandwidth and hard disk mail. Then, we use Boost to issue orders offline to let the SP start packaging using the Lotus program.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "aws s3 ls --no-sign-request s3://hmpdcc/  169 TiB",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "2 to 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, South America, Europe",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03315260 Germany\nf03559187 United States\nf03542777 Vietnam\nf03619143 HongKong\nf03619150 Singapore",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "1PiB",
    "Single Size Dataset": "200TiB",
    "Replicas": 5,
    "Weekly Allocation": "500TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-07-28 06:22:36.346002361 UTC",
    "Validated By": "revelation2525",
    "Active": true,
    "Updated At": "2025-07-28 06:22:36.345998349 UTC",
    "Active Request ID": "c3bcf463-5822-4638-894e-7805b06571e1",
    "On Chain Address": "f1fdtvv57oewvd7eeoyplazum3amcfrpa4dd5ibpi",
    "Multisig Address": "false",
    "edited": true
  },
  "Allocation Requests": [
    {
      "ID": "0bf51d73-f2e0-4009-9953-c3ade00b54af",
      "Request Type": "First",
      "Created At": "2025-07-27 06:32:11.010792529 UTC",
      "Updated At": "2025-07-27 06:32:11.010793576 UTC",
      "Active": false,
      "Allocation Amount": "219902325555200 B",
      "Signers": [
        {
          "Github Username": "revelation2525",
          "Signing Address": "f1honaskpbkfmfz7uffbj2rubgzvmpjxoszlxlmja",
          "Created At": "2025-07-27 06:34:04.434000000 UTC",
          "Message CID": "bafy2bzaceat5wugph7pphy6vhw6e2qulum43upcmaqkubdukzugsnmnyabuhq"
        }
      ]
    },
    {
      "ID": "c3bcf463-5822-4638-894e-7805b06571e1",
      "Request Type": "Refill",
      "Created At": "2025-07-28 06:10:12.724174940 UTC",
      "Updated At": "2025-07-28 06:10:12.724175743 UTC",
      "Active": false,
      "Allocation Amount": "439804651110400B",
      "Signers": [
        {
          "Github Username": "revelation2525",
          "Signing Address": "f1honaskpbkfmfz7uffbj2rubgzvmpjxoszlxlmja",
          "Created At": "2025-07-28 06:22:32.408000000 UTC",
          "Message CID": "bafy2bzacecxloa3fxqapehy4gkwznvobyyx43ess3zadrjn3blszruq7drn3i"
        }
      ]
    }
  ]
}